tests/artillery.yaml
config:
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - "http.response_time.p95": 200
  target: "http://testkube-triggers-example-service.testkube:8080"
  phases:
    - duration: 6
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 15
      arrivalRate: 20
      name: Sustained load
scenarios:
  - name: "Hit performance endpoint"
    flow:
      - get:
          url: "/perf"